In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'X1': [1,2,3],
                   'X2': ['X', 'Y', 'Z']},
                  index=[0,1,2])
df2 = pd.DataFrame({'X3': ['A', 'B', 'C'],
                   'X4': [4,5,6]},
                  index=[1,2,3])

In [3]:
df_left = df1.join(df2, how='left')

In [4]:
df_left

   X1 X2   X3   X4
0   1  X  NaN  NaN
1   2  Y    A  4.0
2   3  Z    B  5.0

In [5]:
df_right = df1.join(df2, how='right')
df_outer = df1.join(df2, how='outer')
df_inner = df1.join(df2, how='inner')

In [6]:
df_right

    X1   X2 X3  X4
1  2.0    Y  A   4
2  3.0    Z  B   5
3  NaN  NaN  C   6

In [7]:
df_inner

   X1 X2 X3  X4
1   2  Y  A   4
2   3  Z  B   5

In [8]:
df_outer

    X1   X2   X3   X4
0  1.0    X  NaN  NaN
1  2.0    Y    A  4.0
2  3.0    Z    B  5.0
3  NaN  NaN    C  6.0